"""
有如下员工信息（见B站课程），请使用字典完成数据的记录
并通过for循环，对所有级别为1级的员工，级别上升1级，薪水增加1000元，最终打印输出所有员工信息
"""
info_dict = {
    "张三": {"部门": "科技部", "工资": 3000, "级别": 1},
    "李四": {"部门": "市场部", "工资": 5000, "级别": 2},
    "王五": {"部门": "市场部", "工资": 7000, "级别": 3},
    "赵六": {"部门": "科技部", "工资": 4000, "级别": 1},
    "孙七": {"部门": "市场部", "工资": 6000, "级别": 2}
}
for name in info_dict:
    if info_dict[name]["级别"] == 1:
        info_dict[name]["级别"] += 1
        info_dict[name]["工资"] += 1000

for name in info_dict:
    print(f"姓名: {name}, 部门: {info_dict[name]['部门']}, 工资: {info_dict[name]['工资']}, 级别: {info_dict[name]['级别']}")