"""
单字符匹配：
    .    ——> 匹配任意1个字符（除了\n），\.匹配点本身
    []   ——> 匹配[]中列举的字符
    \d   ——> 匹配数字，即0-9
    \D   ——> 匹配非数字
    \s   ——> 匹配空白、即空格、tab键
    \S   ——> 匹配非空白
    \w   ——> 匹配单词字符，即a-z、A-Z、0-9、_
    \W   ——> 匹配非单词字符

数量匹配：
    *        ——> 匹配前一个规则的字符出现0至无数次
    +        ——> 匹配前一个规则的字符出现1至无数次
    ?        ——> 匹配前一个规则的字符出现0或1次
    {m}      ——> 匹配前一个规则的字符出现m次
    {m,}     ——> 匹配前一个规则的字符出现最少m次
    {m,n}    ——> 匹配前一个规则的字符出现m到n次

边界匹配：
    ^      ——> 匹配字符串开头
    $      ——> 匹配字符串结尾
    \b     ——> 匹配一个单词的边界
    \B     ——> 匹配非单词边界

分组匹配：
    |       ——> 匹配左右任意一个表达式
    ()      ——> 将括号中字符作为一个分组
"""
import re
s = "itheima1 @@ python2 !!666 ##itcccast3"
# 找出所有数字
result = re.findall(r'\d', s)    # 字符串前面带有r的标记，表示字符串中转义字符无效，就是普通字符
print(result)

# 找出特殊字符
result2 = re.findall(r'\W', s)
print(result2)
# 找出所有字母
result3 = re.findall(r'[a-zA-Z0-9]', s)
print(result3)


# 匹配账号，只能由字母和数字组成，长度限制6-10位
# 规则为：^[0-9a-zA-Z]{6, 10}$

# 匹配QQ号，要求纯数字，长度5-11位，第一位不为0
# 规则为：^[1-9][0-9]{4, 10}$
# [1-9]匹配第一位，[0-9]匹配后面4-10位

# 匹配邮箱地址，只允许qq、163、gmail这三种邮箱地址
# 规则为：^[\W-]+(\.[\W-]+)*@(q|163|gmail)(\.[\W-]+)+$








